# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [13]:
import numpy  as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [4]:
s  = ([1, np.nan, ' Pandas Library '])
s1 = pd.Series(s)
s1

0                   1
1                 NaN
2     Pandas Library
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [6]:
s2 = np.array([2, np.nan, 'b'])
s2 = pd.Series(s2)
s2

0      2
1    nan
2      b
dtype: object

### <center> Method 2: Using a List

In [7]:
list1 = ['animal', '2', 'animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [8]:
list2 = [3, 'c', 'Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [9]:
s5 = pd.Series(
      {'A': 1,
       '3':'Python'
      })
s5

A         1
3    Python
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [10]:
s6 = pd.Series(
      {'Integer': 3,
       'B'      : 'Boys'
      })
s6

Integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [15]:
df = pd.DataFrame(np.random.rand(6,4))  # 6x4 
df

          0         1         2         3
0  0.046073  0.802447  0.695653  0.719335
1  0.190992  0.085872  0.285757  0.994109
2  0.226583  0.635553  0.042033  0.626852
3  0.429564  0.036048  0.380050  0.658620
4  0.802257  0.111283  0.230772  0.521904
5  0.558487  0.987202  0.756982  0.659992

## <center>üèÜ Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [16]:
df1 = pd.DataFrame(np.random.rand(3,3))
df1

          0         1         2
0  0.335991  0.351714  0.794295
1  0.077310  0.158227  0.711047
2  0.943157  0.028818  0.247926

### <center> Method 2: Passing a Dictionary of Objects

In [19]:
df2 = pd.DataFrame({
      'A'     : 1,
      'number': np.array([6]*3, dtype='int32')
})
df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>üèÜ Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [20]:
df3 = pd.DataFrame({
    'E'  : np.array([4]*5, dtype='int32'),
    'Day': 2
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [23]:
df4 = pd.read_csv('practicedata.csv')
df4.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

-----------------

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [25]:
df5 = pd.read_json('practicedata.json')
df5

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [26]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

## <center>üèÜ Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [28]:
df7 = pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center> Export Files

### Export .csv Files

In [30]:
df4.to_csv('practicedata2.csv')

## <center>üèÜ Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [31]:
df4.to_json('practicedata2.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [32]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [33]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [34]:
df6.describe()  # more details about data

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [37]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>üèÜ Challenge
    
View the columns in df7.

In [ ]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

In [38]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [39]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>üèÜ Challenge
    
View the datatypes in df7

In [40]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>Handling Duplicates

### Detect Duplicate Rows

In [45]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [46]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop duplicates in df7

In [47]:
#Detect duplicates
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [48]:
#Drop duplicates
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>Handling Missing Values

### Detect Missing Values

In [50]:
df6.isnull().sum()

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [51]:
df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop missing values in df7

In [53]:
#Detect missing values
df7.isnull().sum()

A    1
B    0
C    0
D    1
dtype: int64

In [54]:
#Drop missing values
df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [55]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0  0.191489  0.139731  0.833341 -0.099675
1  0.322517  1.293327 -0.021423 -1.503795
2  0.351663  0.399188 -2.130441 -0.407696
3  0.235218  2.080878 -1.055004  1.224729
4 -1.351328 -0.781962 -1.533220  0.030360
5  0.453249  0.333577  0.862351  1.313482

### Calculate the Mean:

In [56]:
df8.mean()

0    0.033801
1    0.577457
2   -0.507399
3    0.092901
dtype: float64

## <center>üèÜ Challenge
    
Calculate the mean of df9

In [57]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0  0.311763 -0.774167 -0.354428 -0.165007
1 -3.225132 -0.819524  2.670090 -0.231502
2  0.168790 -0.392483 -2.272808 -0.964568

In [58]:
df9.mean()

0   -0.914860
1   -0.662058
2    0.014285
3   -0.453692
dtype: float64

### Calculate the Cumulative Sum:

In [61]:
df8.apply(np.cumsum)

          0         1         2         3
0  0.191489  0.139731  0.833341 -0.099675
1  0.514006  1.433058  0.811918 -1.603470
2  0.865669  1.832246 -1.318523 -2.011165
3  1.100887  3.913124 -2.373527 -0.786436
4 -0.250441  3.131162 -3.906747 -0.756076
5  0.202807  3.464739 -3.044396  0.557406

## <center>üèÜ Challenge
    
Calculate the cumulative sum of df9

In [60]:
df9.apply(np.cumsum)

          0         1         2         3
0  0.311763 -0.774167 -0.354428 -0.165007
1 -2.913369 -1.593691  2.315662 -0.396509
2 -2.744579 -1.986174  0.042854 -1.361077

### Find the Maximum Value:

In [62]:
df8.max()

0    0.453249
1    2.080878
2    0.862351
3    1.313482
dtype: float64

## <center>üèÜ Challenge

Find the maximum value of df9

In [63]:
df9.max()

0    0.311763
1   -0.392483
2    2.670090
3   -0.165007
dtype: float64

### Find the Minimum Value:

In [64]:
df8.min()

0   -1.351328
1   -0.781962
2   -2.130441
3   -1.503795
dtype: float64

## <center>üèÜ Challenge

Find the minimum value of df9

In [65]:
df9.min()

0   -3.225132
1   -0.819524
2   -2.272808
3   -0.964568
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [66]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7 = pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [67]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to lower case.

In [70]:
s8 = np.array(['cat', 'dog', 'Python Programming'])
s8 = pd.Series(s8)
s8.str.lower()

0                   cat
1                   dog
2    python programming
dtype: object

---------------

### Convert to Upper Case

In [71]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to upper case.

In [72]:
s8.str.upper()

0                   CAT
1                   DOG
2    PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [73]:
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>üèÜ Challenge

Swap the capitalization of the strings in s8.

In [74]:
s8.str.swapcase()

0                   CAT
1                   DOG
2    pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [75]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [76]:
s8.str.len()

0     3
1     3
2    18
dtype: int64

-------------

### Split String

In [77]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [ ]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8 = pd.Series(s8)
s8

In [78]:
s8.str.len()

0     3
1     3
2    18
dtype: int64

### Detect Unique Values

In [79]:
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>üèÜ Challenge

Detect unique values in s8.

In [80]:
s8.unique()

array(['cat', 'dog', 'Python Programming'], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [ ]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

In [81]:
repeat_list = [1,2,3]
s7.str.repeat(repeat_list)

0                                               animal
1                                             birdbird
2     Pandas Library   Pandas Library   Pandas Libr...
dtype: object

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [83]:
# <center>üèÜ Challenge
# Repeat the values in s8 in the order [1,2,3]

In [84]:
repeat_list = [1,2,3]
s8.str.repeat(repeat_list)

0                                                  cat
1                                               dogdog
2    Python ProgrammingPython ProgrammingPython Pro...
dtype: object